{
  "language": "English",
  "reverse": "ქართული",
  "skip": "Skip to About",
  "page_not_found": "Page not found",
  "go_back": "Navigate home",
  "navbar": {
    "about": "About",
    "experience": "Experience",
    "work": "Work",
    "contact": "Contact",
    "resume": "Resume"
  },
  "info": {
    "greeting": "Hi, my name is",
    "fullName": "Konstantine Datunishvili.",
    "profession": "I create websites.",
    "detailed": "I am a Front-End Angular Developer with experience in Back-End Development. I am currently working as a Front-End Developer while also teaching Front-End Development at ",
    "academy": "IT STEP Academy"
  },
  "about": {
    "header": "About me",
    "first_text": "Hello, I am Konstantine Datunishvili, a Front-End Angular Developer. I have a passion for creating intuitive user interfaces via Angular.",
    "second_text_first": "I teach at",
    "second_text_second": "since September 2021 and have previously worked on various projects and companies.",
    "third_text": "Also possess Back-End development knowledge and can build Full-Stack projects with Node & Angular. I strive to keep up with the latest trends in web development.",
    "forth_text": "Here are a few technologies I've been working with recently:"
  },
  "experience": {
    "header": "Where I've Worked",
    "itstep": {
      "name": "Academy IT Step",
      "at": "Academy IT Step",
      "position": "Lecturer",
      "date": "Sep 2021 - Present",
      "details": {
        "1": "As a Lecturer specializing in front-end development, I conduct live sessions for students on Microsoft Teams. All sessions are recorded for students to review at their convenience.",
        "2": "I cover topics such as HTML, CSS, SCSS, Bootstrap, JavaScript, SweetAlert, Angular, Angular Material, and provide a brief introduction to RxJS.",
        "3": "I also assign and evaluate homework to reinforce learning and provide feedback.",
        "4": "My goal is to create an engaging learning environment and equip students with the skills needed for successful careers in front-end development."
      }
    },
    "payever": {
      "name": "Payever",
      "at": "Payever",
      "position": "Front-End Angular Developer",
      "date": "Oct - Dec 2022",
      "details": {
        "1": "I was developing and maintain frontend applications based on Angular.",
        "2": "Developed UI/UX features in Angular as described and displayed in the graphical design, ensure and advice on the technical feasibility of the UI/UX designs.",
        "3": "Optimize applications for scalability, cross-browser, cross-device and built reusable code for future use.",
        "4": "Work products were written in HTML5, SCSS and Angular."
      }
    },
    "freelance": {
      "name": "Freelance",
      "at": "Freelance",
      "position": "Freelance projects",
      "date": "Mar 2021 - Present",
      "details": {
        "1": "I am an experienced Full-stack developer specializing in Angular for Front-end development and Node.js with Express and MongoDB for Back-end development.",
        "2": "With a proven track record of successfully delivering projects, I have worked on various assignments creating dynamic user interfaces and implementing efficient data storage solutions."
      }
    }
  },
  "projects": {
    "header": "Some Things I've Built",
    "registry_imdo": {
      "tag": "Featured Project",
      "title": "Registry Imdo",
      "description": "This digital platform was designed for the verification of certificates designed by the Irish Imdo Maritime Authority. The aim of Maritime Authority of Irish Imdo is to come to a safe maritime environment in compliance with International Rules and Regulations.",
      "tags": {
        "1": "Angular",
        "2": "Angular Material",
        "3": "Express",
        "4": "MongoDB",
        "5": "Full-stack"
      }
    },
    "iswavle": {
      "tag": "Featured Project",
      "title": "Iswavle",
      "description": "This website provides free learning resources for Front End development. The website has a built-in code editor that allows you to write and experiment with code directly on the platform. You can practice with practical examples integrated into educational articles. The website is available only in the Georgian language.",
      "tags": {
        "1": "Angular",
        "2": "Firebase",
        "3": "SSR",
        "4": "SEO",
        "5": "Express",
        "6": "MongoDB",
        "7": "Full-stack"
      }
    },
    "qr_code": {
      "tag": "Featured Project",
      "title": "QR Code",
      "description": "I have developed the scientific project titled 'Multi-level Access of Information Systems by QR Codes'. The idea has been successfully implemented and demonstrated through the example of a higher educational institution, specifically a university.",
      "tags": {
        "1": "Angular",
        "2": "Express",
        "3": "MongoDB",
        "4": "Full-stack",
        "5": "QR Codes"
      }
    }
  },
  "other_projects": {
    "header": "Other Noteworthy Projects",
    "view_archive": "View archive",
    "sliding_game": {
      "name": "Sliding puzzle game",
      "description": "Starting at the top left corner, move the tiles in ascending order in the grid. The tile in the lower right corner should remain 'empty'."
    },
    "memory_card_game": {
      "name": "Memory card game",
      "description": "The objective of the game is to match all pairs of cards as quickly as possible."
    },
    "color_game": {
      "name": "Color game",
      "description": "Guess the color based on the color format RGB or HEX. The colors are randomly generated."
    },
    "qr_project": {
      "name": "QR read & write",
      "description": "Generate QR code with or without an image, or read a QR image."
    },
    "realtime_chat": {
      "name": "Real-time Chat",
      "description": "Join our real-time chat platform to connect instantly with others in general or specialized groups."
    },
    "qa_exercise": {
      "name": "QA Exercise",
      "description": "Discover hidden bugs and vulnerabilities in your Simple Auth/OAuth 2.0 system with our expert testing."
    }
  }
}