{
  "language": "ქართული",
  "navbar": {
    "about": "ჩემს შესახებ",
    "experience": "გამოცდილება",
    "work": "ნამუშევრები",
    "contact": "კონტაქტი",
    "resume": "რეზიუმე"
  },
  "info": {
    "greeting": "გამარჯობა, მე მქვია",
    "fullName": "კონსტანტინე დათუნიშვილი.",
    "profession": "მე ვაკეთებ საიტებს.",
    "detailed": "მე ვარ Front-End ანგულარ დეველოპერი Back-End ის გამოცდილებით. ამჟამად ვმუშაობ, როგორც Front-End დეველოპერი, ამავდროულად ვასწავლი Front-End ს ",
    "academy": "IT აკადემია სტეპში"
  },
  "about": {
    "header": "ჩემს შესახებ",
    "first_text": "გამარჯობა, მე ვარ კონსტანტინე დათუნიშვილი, Front-End ანგულარ დეველოპერი. მე ვამზადებ საიტებს ანგულარის გამოყენებით.",
    "second_text_first": "მე ვასწავლი",
    "second_text_second": "2021 წლის სექტემბრიდან, მანამდე მიმუშავია სხვადასხვა პროექტებზე და კომპანიებზე.",
    "third_text": "ასევე მაქვს Back-End დეველოპმენტის გამოცდილება და შემიძლია ავაწყო Full-Stack პროექტები Node-ს & Angular-ს გამოყენებით. ვცდილობ გამოვიყენო ყოველ პროექტში უახლესი პრაქტიკა.",
    "forth_text": "რამოდენიმე ტექნოლოგია, რომლებთანაც მიმუშავია ეს ბოლო პერიოდი:"
  },
  "experience": {
    "header": "Where I've Worked",
    "itstep": {
      "name": "Academy IT Step",
      "position": "Lecturer",
      "date": "Sep 2021 - Present",
      "details": {
        "1": "As a Lecturer specializing in front-end development, I conduct live sessions for students on Microsoft Teams. All sessions are recorded for students to review at their convenience.",
        "2": "I cover topics such as HTML, CSS, SCSS, Bootstrap, JavaScript, SweetAlert, Angular, Angular Material, and provide a brief introduction to RxJS.",
        "3": "I also assign and evaluate homework to reinforce learning and provide feedback.",
        "4": "My goal is to create an engaging learning environment and equip students with the skills needed for successful careers in front-end development."
      }
    },
    "payever": {
      "name": "Payever",
      "position": "Front-End Angular Developer",
      "date": "Oct - Dec 2022",
      "details": {
        "1": "I was developing and maintain frontend applications based on Angular.",
        "2": "Developed UI/UX features in Angular as described and displayed in the graphical design, ensure and advice on the technical feasibility of the UI/UX designs.",
        "3": "Optimize applications for scalability, cross-browser, cross-device and built reusable code for future use.",
        "4": "Work products were written in HTML5, SCSS and Angular."
      }
    }
  }
}