{
  "language": "ქართული",
  "reverse": "English",
  "skip": "გადადი ჩემს შესახებ სექციაზე",
  "page_not_found": "გვერდი ვერ მოიძებნა",
  "go_back": "მთავარზე დაბრუნება",
  "navbar": {
    "about": "ჩემს შესახებ",
    "experience": "გამოცდილება",
    "work": "ნამუშევრები",
    "contact": "კონტაქტი",
    "resume": "რეზიუმე"
  },
  "info": {
    "greeting": "გამარჯობა, მე ვარ",
    "fullName": "კონსტანტინე დათუნიშვილი.",
    "profession": "მე ვაკეთებ საიტებს.",
    "detailed": "მე ვარ Angular Front-End დეველოპერი, მაქვს Back-End ის გამოცდილება. ამჟამად ვმუშაობ, როგორც Front-End დეველოპერი და ამავდროულად ვასწავლი Front-End-ს ",
    "academy": "IT აკადემია სტეპში"
  },
  "about": {
    "header": "ჩემს შესახებ",
    "first_text": "გამარჯობა, მე ვარ კონსტანტინე დათუნიშვილი, Front-End Angular დეველოპერი. მე ვამზადებ საიტებს Angualar-ის გამოყენებით.",
    "second_text_first": "მე ვასწავლი",
    "second_text_second": "2021 წლის სექტემბრიდან, მანამდე მიმუშავია სხვადასხვა პროექტებზე და კომპანიებზე.",
    "third_text": "ასევე მაქვს Back-End დეველოპმენტის გამოცდილება და შემიძლია ავაწყო Full-Stack პროექტები Node-ს & Angular-ს გამოყენებით. ვცდილობ გამოვიყენო ყოველ პროექტში უახლესი პრაქტიკა.",
    "forth_text": "რამოდენიმე ტექნოლოგია, რომლებთანაც მიმუშავია ეს ბოლო პერიოდი:"
  },
  "experience": {
    "header": "სამუშაო გამოცდილება",
    "itstep": {
      "name": "Academy IT Step",
      "at": "IT აკადემია სტეპში",
      "position": "ლექტორი",
      "date": "სექ 2021 - აწმყო",
      "details": {
        "1": "როგორც ლექტორი, ჩემი სამუშაო სპეციალიზირდება Front-end დეველოპმენტთან, ლექციები თიმსის დახმარებით ტარდება. ყოველი ლექცია იწერება, რათა სტუდენტებმა შეძლონ ლექციის შემდგომ განხილვა ან გამეორება.",
        "2": "ჩვენ გავდივართ ისეთ ტექნოლოგიებს, როგორიცაა: HTML, CSS, SCSS, Bootstrap, JavaScript, SweetAlert, Angular, Angular Material და მცირედი შეხება გვაქვს RxJS-ს თან.",
        "3": "ასევე ჩვენ გვაქვს საშინაო დავალებების სისტემა, რითაც სტუდენტებთან ვამყარებ უკუკავშირს და ვხედავ მათ მიერ შეძენილ ცოდნას.",
        "4": "ჩემი მიზანია შევქმნა საინტერესო სასწავლო გარემო და ვასწავლო სტუდენტებს ისეთი უნარები, რომლებიც დაეხმარება წარმატებული კარიერის მიღწევაში."
      }
    },
    "payever": {
      "name": "Payever",
      "at": "Payever",
      "position": "Front-End Angular დეველოპერი",
      "date": "ოქტ - დეკ 2022",
      "details": {
        "1": "მე ვქმნიდი Front-end აპლიკაციებს Angular-ის დახმარებით.",
        "2": "ვქმნიდი UI/UX მოდულებს Angular-ის საშუალებით, გრაფიკოს დიზაინერის მოთხოვნის შესაბამისად, ასევე მონაწილოებას ვღებულობდი UI/UX დიზაინის დამზადებაში.",
        "3": "ოპტიმიზაციას ვუწევდი ალპიკაციას იმისათვის, რომ შედეგი ყოფილიყო cross-browser და cross-device აპლიკაცია და არსებული კოდი ყოფილიყო სამომავლოდ გამოსადეგი.",
        "4": "აპლიკაცია დაწერილი იყო HTML5, SCSS და Angular."
      }
    },
    "freelance": {
      "name": "Freelance",
      "at": "Freelance",
      "position": "Freelance პროექტები",
      "date": "მარ 2021 - აწმყო",
      "details": {
        "1": "მე ვარ გამოცდილი Full-stack დეველოპერი, Front-end-ში ანგულარის გამოყენებით, ხოლო Back-end-ში კი Node.js Express საშუალებით და MongoDB მონაცემთა ბაზით.",
        "2": "სხვადასხვა პროექტიდან მიღებული გამოცდილებით შემიძლია შევქმნა სხვადასხვა ტიპის სამომხმარებლო ინტერფეისები, ასევე მონაცემთა შენახვის და დამუშავების ეფექტური გზით."
      }
    }
  },
  "projects": {
    "header": "Some Things I've Built",
    "registry_imdo": {
      "tag": "Featured Project",
      "title": "Registry Imdo",
      "description": "This digital platform was designed for the verification of certificates designed by the Irish Imdo Maritime Authority. The aim of Maritime Authority of Irish Imdo is to come to a safe maritime environment in compliance with International Rules and Regulations.",
      "tags": {
        "1": "Angular",
        "2": "Angular Material",
        "3": "Express",
        "4": "MongoDB",
        "5": "Full-stack"
      }
    },
    "iswavle": {
      "tag": "Featured Project",
      "title": "Iswavle",
      "description": "This website provides free learning resources for Front End development. The website has a built-in code editor that allows you to write and experiment with code directly on the platform. You can practice with practical examples integrated into educational articles. The website is available only in the Georgian language.",
      "tags": {
        "1": "Angular",
        "2": "Firebase",
        "3": "SSR",
        "4": "SEO",
        "5": "Express",
        "6": "MongoDB",
        "7": "Full-stack"
      }
    },
    "qr_code": {
      "tag": "Featured Project",
      "title": "QR Code",
      "description": "I have developed the scientific project titled 'Multi-level Access of Information Systems by QR Codes'. The idea has been successfully implemented and demonstrated through the example of a higher educational institution, specifically a university.",
      "tags": {
        "1": "Angular",
        "2": "Express",
        "3": "MongoDB",
        "4": "Full-stack",
        "5": "QR Codes"
      }
    }
  },
  "other_projects": {
    "header": "Other Noteworth Projects",
    "view_archive": "View archive",
    "sliding_game": {
      "name": "Sliding puzzle game",
      "description": "Starting at the top left corner, move the tiles in ascending order in the grid. The tile in the lower right corner should remain 'empty'."
    },
    "memory_card_game": {
      "name": "Memory card game",
      "description": "The objective of the game is to match all pairs of cards as quickly as possible."
    },
    "color_game": {
      "name": "Color game",
      "description": "Guess the color based on the color format RGB or HEX. The colors are randomly generated."
    },
    "qr_project": {
      "name": "QR read & write",
      "description": "Generate QR code with or without an image, or read a QR image."
    },
    "realtime_chat": {
      "name": "Real-time Chat",
      "description": "Join our real-time chat platform to connect instantly with others in general or specialized groups."
    },
    "qa_exercise": {
      "name": "QA Exercise",
      "description": "Discover hidden bugs and vulnerabilities in your Simple Auth/OAuth 2.0 system with our expert testing."
    }
  }
}