{
  "language": "ქართული",
  "reverse": "English",
  "skip": "გადადი ჩემს შესახებ სექციაზე",
  "page_not_found": "გვერდი ვერ მოიძებნა",
  "go_back": "მთავარზე დაბრუნება",
  "navbar": {
    "about": "ჩემს შესახებ",
    "experience": "გამოცდილება",
    "work": "ნამუშევრები",
    "contact": "კონტაქტი",
    "resume": "რეზიუმე"
  },
  "info": {
    "greeting": "გამარჯობა, მე ვარ",
    "fullName": "კონსტანტინე დათუნიშვილი.",
    "profession": "მე ვაკეთებ საიტებს.",
    "detailed": "მე ვარ Angular Front-End დეველოპერი, მაქვს Back-End ის გამოცდილება. ამჟამად ვმუშაობ, როგორც Front-End დეველოპერი და ამავდროულად ვასწავლი Front-End-ს ",
    "academy": "IT აკადემია სტეპში"
  },
  "about": {
    "header": "ჩემს შესახებ",
    "first_text": "გამარჯობა, მე ვარ კონსტანტინე დათუნიშვილი, Front-End Angular დეველოპერი. მე ვქმნი საიტებს Angualar-ის გამოყენებით.",
    "second_text_first": "2021 წლიდან ვასწავლი ",
    "second_text_second": "ამასთანავე მიმუშავია სხვადასხვა კომპანიებსა და პროექტებზე.",
    "third_text": "გარდა ამისა მაქვს Back-End დეველოპმენტის გამოცდილება, რომელიც მაძლევს შესაძლებლობას ავაწყო Full-Stack პროექტები Node-ს & Angular-ს გამოყენებით. თითოეულ პროექტში ვცდილობ გამოვიყენო უახლოესი პრაქტიკა და მეთოდები.",
    "forth_text": "ბოლო პერიოდში გამოყენებული ტექნოლოგიები:"
  },
  "experience": {
    "header": "სამუშაო გამოცდილება",
    "itstep": {
      "name": "Academy IT Step",
      "at": "IT აკადემია სტეპში",
      "position": "ლექტორი",
      "date": "სექ 2021 - აწმყო",
      "details": {
        "1": "როგორც ლექტორი, ჩემი სამუშაო უკავშირდება Front-end დეველოპმენტს. ლექციები ონლაინ, Team-ის საშუალებით ტარდება. აღსანიშნავია, რომ ყოველი ლექცია იწერება, იმისათვის რომ სტუდენტებმა ლექციის შემდგომ განხილვა ან გამეორება შეძლონ.",
        "2": "სასწავლო პროგრამა ითვალისწინებს ისეთ ტექნოლოგიებს, როგორებიცაა: HTML, CSS, SCSS, Bootstrap, JavaScript, SweetAlert, Angular, Angular Material და მცირედით განვიხილავთ RxJS-ს.",
        "3": "ამასთანავე მოსწავლეებისათვის შექმნილია საშინაო დავალებების სისტემა, რომლის დახმარებითაც  შესაძლოა უკუკავშირის დამყარება და მათ მიერ შეძენილ ცოდნის შემოწმება.",
        "4": "ჩემი მიზანია შევქმნა საინტერესო სასწავლო გარემო და შევძინო სტუდენტებს უნარები, რომლებიც დაეხმარება მათ წარმატებული კარიერის მიღწევაში."
      }
    },
    "payever": {
      "name": "Payever",
      "at": "Payever",
      "position": "Front-End Angular დეველოპერი",
      "date": "ოქტ - დეკ 2022",
      "details": {
        "1": "ამ პერიოდის განმავლობაში ვქმნიდი Front-end აპლიკაციებსა და UI/UX მოდულებს გრაფიკოს დიზაინერის მოთხოვნით, Angular-ის საშუალებით.",
        "2": "ვქმნიდი UI/UX მოდულებს Angular-ის საშუალებით, გრაფიკოს დიზაინერის მოთხოვნის შესაბამისად, ასევე მონაწილოებას ვღებულობდი UI/UX დიზაინის დამზადებაში.",
        "3": "ამასთანავე ოპტიმიზაციას ვუწევდი აპლიკაციის იმისათვის, რომ cross-browser და cross-device აპლიკაცია მიგვეღო შედეგად და არსებული კოდი მომავალში რეალიზებადი გამოსულიყო.",
        "4": "აპლიკაცია დაწერილი იყო HTML5, SCSS და Angular."
      }
    },
    "freelance": {
      "name": "Freelance",
      "at": "Freelance",
      "position": "Freelance პროექტები",
      "date": "მარ 2021 - აწმყო",
      "details": {
        "1": "მე ვარ გამოცდილი Full-stack დეველოპერი, Front-end-ში ანგულარის გამოყენებით, ხოლო Back-end-ში კი Node.js Express საშუალებით და MongoDB მონაცემთა ბაზით.",
        "2": "სხვადასხვა პროექტიდან მიღებული გამოცდილებით შემიძლია შევქმნა განსხვავებული ტიპის სამომხმარებლო ინტერფეისები, მონაცემთა შენახვისა და დამუშავების ეფექტური გზით."
      }
    }
  },
  "projects": {
    "header": "ჩემი პროექტები",
    "EverREST": {
      "tag": "გამორჩეული პროექტი",
      "title": "EverREST",
      "description": "EverREST შეიქმნა იმისათვის, რომ Front-End დეველოპერებს შესაძლებლობა ჰქონოდა უკეთესი ვებგვერდები გაეკეთებინათ. იდეა მარტივია, როცა Front-End სწავლობ რთულია კარგი API სერვისები იპოვო, ამიტომაც შეიქმნა EverREST. ყოველგავრი თანხის გარეშე შესაძლებელია სხვადასხვა სერვისების გამოყენება.",
      "tags": {
        "1": "Nest.js",
        "2": "mdBook",
        "3": "MongoDB",
        "4": "JWT",
        "5": "QR"
      }
    },
    "iswavle": {
      "tag": "გამორჩეული პროექტი",
      "title": "Iswavle",
      "description": "ეს ვებსაიტი გთავაზობთ უფასო სასწავლო რესურსებს ფრონტის განვითარებისთვის. ვებსაიტს აქვს ჩაშენებული კოდის რედაქტორი, რომელიც საშუალებას გაძლევთ დაწეროთ და ექსპერიმენტი გააკეთოთ კოდით პირდაპირ პლატფორმაზე. შეგიძლიათ ივარჯიშოთ სტატიებში შეტანილი პრაქტიკული მაგალითებით. საიტი ხელმისაწვდომია მხოლოდ ქართულ ენაზე.",
      "tags": {
        "1": "Angular",
        "2": "Firebase",
        "3": "SSR",
        "4": "SEO",
        "5": "Express",
        "6": "MongoDB",
        "7": "Full-stack"
      }
    },
    "qr_code": {
      "tag": "გამორჩეული პროექტი",
      "title": "QR Code",
      "description": "მე შევიმუშავე სამეცნიერო პროექტი სახელწოდებით 'ინფორმაციული სისტემების მრავალდონიანი წვდომა QR კოდებით'. იდეა წარმატებით განხორციელდა და იმუშავა უმაღლესი საგანმანათლებლო დაწესებულების, კონკრეტულად კი უნივერსიტეტის მაგალითზე.",
      "tags": {
        "1": "Angular",
        "2": "Express",
        "3": "MongoDB",
        "4": "Full-stack",
        "5": "QR Codes"
      }
    }
  },
  "other_projects": {
    "header": "სხვა საყურადღებო პროექტები",
    "view_archive": "არქივის ხილვა",
    "old_iswavle": {
      "name": "Iswavle (დაარქივებული)",
      "description": "ეს არის ძველი ვერსია ამჟამინდელი Iswavle-სი."
    },
    "shoployalty": {
      "name": "Shop loyalty",
      "description": "ლოიალურობის პროგრამა მაღაზიებში. QR კოდების დასკანერებით, პროდუქტების კალათაში დამატება და ფაზდაკლებების მიღების აპლიკაცია."
    },
    "ngxcubeloader": {
      "name": "NgxCubeLoader",
      "description": "კონფიგურირებადი Angular-ის კუბის ჩატვრითვის ანიმაცია სხვადასხვა თემებით."
    },
    "algorithms": {
      "name": "Algorithms",
      "description": "სხვადასხვა ძირითადი ალგორითმები არის გაერთიანებული ერთ JavaScript-ის კოდში. დალაგების და მოძებნის ალგორითმები."
    },
    "realtime_chat": {
      "name": "Realtime Chat",
      "description": "რეალურ დროში ჩათის აპლიკაცია, სადაც ჩათი შესაძლებელია დახურულ ჯგუფებში ან საერთო ჯგუფში."
    },
    "qr_project": {
      "name": "QR read & write",
      "description": "QR კოდის დაგენერირება სურათით ან სურათის გარეშე, ასევე QR კოდის წაკითხვა."
    }
  },
  "contact": {
    "header": "შემეხმიანე",
    "description": "ამჟამად ვეძებ ახალ შესაძლებლობებს, ჩემი ინბოქსი ყოველთვის ღიაა. გაქვთ თუ არა შეკითხვა, ან უბრალოდ გსურთ გამარჯობის თქმა, შემეხმიანეთ!",
    "text": "დამიკავშირდი"
  },
  "archive": {
    "header": "არქივი",
    "subtitle": "საჯარო პროექტების სია, რაზეც ვმუშაობდი, ასევე მაქვს რამდენიმე პროექტი, რომელიც არ არის გამოქვეყნებული ან კერძოა.",
    "year": "წელი",
    "title": "დასახელება",
    "made_at": "გაკეთებულია",
    "built_with": "ხელსაწყო",
    "link": "მისამართი"
  },
  "qr": {
    "title": "Multi-level access to information systems by QR codes for wearable devices",
    "role": {
      "title": "ჩემი როლი პროექტში",
      "text_1": "როგორც დეველოპერი, მე პასუხისმგებელი ვიყავი კოდის შემუშავებასა და ოპტიმიზაციაზე, ამასთანავე აპლიკაციის შექმნასა და ფუნქციონალობის განვითარებაზე."
    },
    "abstract": {
      "title": "აბსტრაქცია",
      "text_1": "ბათუმის სახელმწიფო უნივერსიტეტის სამეცნიერო საგრანტო პროექტის ფარგლებში განხორციელდა სამეცნიერო პროექტი „ინფორმაციული სისტემების მრავალდონიანი წვდომა QR კოდებით აცვიათ მოწყობილობებისთვის“.",
      "text_2": "იდეა პრაქტიკულად განხორციელებულია და განიხილება უმაღლესი საგანმანათლებლო დაწესებულების (უნივერსიტეტის) მაგალითზე. ასევე აღნიშნულია ბიზნესისა და სახელმწიფო ორგანიზაციების სხვადასხვა სფეროები, სადაც შესაძლებელია მიღებული შედეგების წარმატებით პრაქტიკულად განხორციელება.",
      "text_3": "სამეცნიერო კვლევებზე დაყრდნობით შეიქმნა ორიგინალური პროგრამული პროდუქტი, რომლის საშუალებითაც სხვადასხვა ობიექტზე განთავსებული მხოლოდ ერთი სტატიკური QR კოდი (ჩვენს კვლევის რეჟიმში, BSU აუდიტორია) საშუალებას აძლევს სხვადასხვა თანამდებობისა თუ პოზიციის ადამიანებს სხვადასხვა მონაცემებზე წვდომა მიიღონ, ჩვენს შემთხვევაში, თანამშრომლებსა და სტუდენტებს. ამავდროულად, ოთახზე მინიჭებული QR კოდი უცვლელი რჩება იმ შემთხვევაშიც კი, თუ ოთახში მიმდინარე პროცესები იცვლება, რითაც გამოირიცხება ოთახში(ობიექტზე) განთავსებული გრაფიკული გამოსახულების (QR კოდი) ხშირი ცვლილებება.",
      "text_4": "მინიჭებულ ინფორმაციასთან დაკავშირებული საჭირო ცვლილებები განხორციელდება მხოლოდ ელექტრონული ფორმით იმ ვებ გვერდზე, სადაც განთავსებულია ეს მონაცემები და მომხმარებელი მიიღებს მხოლოდ განახლებულ ინფორმაციას. სხვა მაგალითისთვის, მეთოდი შეიძლება გამოყენებულ იქნას ქალაქების, მათ შორის ტურისტული ობიექტების, რესტორნების, კაფეების, ბანკების და ა.შ. ციფრულიზაციისთვის, რათა მიაწოდოს სხვადასხვა ინფორმაცია სხვადასხვა წვდომის დონის მომხმარებელთა შესახებ (ლოიალობის პროგრამები და ა.შ.) ერთი QR კოდის საშუალებით.",
      "text_5": "სისტემის პრაქტიკული გამოყენების სფერო შეიძლება საკმაოდ ვრცელი იყოს მისი სიმარტივისა და ტექნოლოგიური პრაქტიკულობის თვალსაზრისით. კვლევის მეთოდოლოგია ეფუძნება კომპიუტერული ტექნოლოგიების, ინტერნეტ ტექნოლოგიებისა და პროგრამირების ხელსაწყოების თანამედროვე მიღწევებს. ეს ტექნოლოგიები ფართოდ გამოიყენება კვლევის პროცესში და კვლევის ერთ-ერთ შედეგში – პროგრამულ პროდუქტში."
    }
  }
}
