{
  "language": "ქართული",
  "reverse": "English",
  "skip": "გადადი ჩემს შესახებ სექციაზე",
  "page_not_found": "გვერდი ვერ მოიძებნა",
  "go_back": "მთავარზე დაბრუნება",
  "navbar": {
    "about": "ჩემს შესახებ",
    "experience": "გამოცდილება",
    "work": "ნამუშევრები",
    "contact": "კონტაქტი",
    "resume": "რეზიუმე"
  },
  "info": {
    "greeting": "გამარჯობა, მე ვარ",
    "fullName": "კონსტანტინე დათუნიშვილი.",
    "profession": "მე ვაკეთებ საიტებს.",
    "detailed": "მე ვარ Angular Front-End დეველოპერი, მაქვს Back-End ის გამოცდილება. ამჟამად ვმუშაობ, როგორც Front-End დეველოპერი და ამავდროულად ვასწავლი Front-End-ს ",
    "academy": "IT აკადემია სტეპში"
  },
  "about": {
    "header": "ჩემს შესახებ",
    "first_text": "გამარჯობა, მე ვარ კონსტანტინე დათუნიშვილი, Front-End Angular დეველოპერი. მე ვქმნი საიტებს Angualar-ის გამოყენებით.",
    "second_text_first": "2021 წლიდან ვასწავლი ",
    "second_text_second": "ამასთანავე მიმუშავია სხვადასხვა კომპანიებსა და პროექტებზე.",
    "third_text": "გარდა ამისა მაქვს Back-End დეველოპმენტის გამოცდილება, რომელიც მაძლევს შესაძლებლობას ავაწყო Full-Stack პროექტები Node-ს & Angular-ს გამოყენებით. თითოეულ პროექტში ვცდილობ გამოვიყენო უახლოესი პრაქტიკა და მეთოდები.",
    "forth_text": "ბოლო პერიოდში გამოყენებული ტექნოლოგიები:"
  },
  "experience": {
    "header": "სამუშაო გამოცდილება",
    "itstep": {
      "name": "Academy IT Step",
      "at": "IT აკადემია სტეპში",
      "position": "ლექტორი",
      "date": "სექ 2021 - აწმყო",
      "details": {
        "1": "როგორც ლექტორი, ჩემი სამუშაო უკავშირდება Front-end დეველოპმენტს. ლექციები ონლაინ, Team-ის საშუალებით ტარდება. აღსანიშნავია, რომ ყოველი ლექცია იწერება, იმისათვის რომ სტუდენტებმა ლექციის შემდგომ განხილვა ან გამეორება შეძლონ.",
        "2": "სასწავლო პროგრამა ითვალისწინებს ისეთ ტექნოლოგიებს, როგორებიცაა: HTML, CSS, SCSS, Bootstrap, JavaScript, SweetAlert, Angular, Angular Material და მცირედით განვიხილავთ RxJS-ს.",
        "3": "ამასთანავე მოსწავლეებისათვის შექმნილია საშინაო დავალებების სისტემა, რომლის დახმარებითაც  შესაძლოა უკუკავშირის დამყარება და მათ მიერ შეძენილ ცოდნის შემოწმება.",
        "4": "ჩემი მიზანია შევქმნა საინტერესო სასწავლო გარემო და შევძინო სტუდენტებს უნარები, რომლებიც დაეხმარება მათ წარმატებული კარიერის მიღწევაში."
      }
    },
    "payever": {
      "name": "Payever",
      "at": "Payever",
      "position": "Front-End Angular დეველოპერი",
      "date": "ოქტ - დეკ 2022",
      "details": {
        "1": "ამ პერიოდის განმავლობაში ვქმნიდი Front-end აპლიკაციებსა და UI/UX მოდულებს გრაფიკოს დიზაინერის მოთხოვნით, Angular-ის საშუალებით.",
        "2": "ვქმნიდი UI/UX მოდულებს Angular-ის საშუალებით, გრაფიკოს დიზაინერის მოთხოვნის შესაბამისად, ასევე მონაწილოებას ვღებულობდი UI/UX დიზაინის დამზადებაში.",
        "3": "ამასთანავე ოპტიმიზაციას ვუწევდი აპლიკაციის იმისათვის, რომ cross-browser და cross-device აპლიკაცია მიგვეღო შედეგად და არსებული კოდი მომავალში რეალიზებადი გამოსულიყო.",
        "4": "აპლიკაცია დაწერილი იყო HTML5, SCSS და Angular."
      }
    },
    "freelance": {
      "name": "Freelance",
      "at": "Freelance",
      "position": "Freelance პროექტები",
      "date": "მარ 2021 - აწმყო",
      "details": {
        "1": "მე ვარ გამოცდილი Full-stack დეველოპერი, Front-end-ში ანგულარის გამოყენებით, ხოლო Back-end-ში კი Node.js Express საშუალებით და MongoDB მონაცემთა ბაზით.",
        "2": "სხვადასხვა პროექტიდან მიღებული გამოცდილებით შემიძლია შევქმნა განსხვავებული ტიპის სამომხმარებლო ინტერფეისები, მონაცემთა შენახვისა და დამუშავების ეფექტური გზით."
      }
    }
  },
  "projects": {
    "header": "ჩემი პროექტები",
    "registry_imdo": {
      "tag": "გამორჩეული პროექტი",
      "title": "Registry Imdo",
      "description": "ეს ციფრული პლატფორმა შეიქმნა ირლანდიის Imdo საზღვაო ორგანოს მიერ შექმნილი სერთიფიკატების გადამოწმებისთვის. ირლანდიური Imdo საზღვაო ორგანოს მიზანია უსაფრთხო საზღვაო გარემოს მიღწევა საერთაშორისო წესებისა და რეგულაციების შესაბამისად.",
      "tags": {
        "1": "Angular",
        "2": "Angular Material",
        "3": "Express",
        "4": "MongoDB",
        "5": "Full-stack"
      }
    },
    "iswavle": {
      "tag": "გამორჩეული პროექტი",
      "title": "Iswavle",
      "description": "ეს ვებსაიტი გთავაზობთ უფასო სასწავლო რესურსებს ფრონტის განვითარებისთვის. ვებსაიტს აქვს ჩაშენებული კოდის რედაქტორი, რომელიც საშუალებას გაძლევთ დაწეროთ და ექსპერიმენტი გააკეთოთ კოდით პირდაპირ პლატფორმაზე. შეგიძლიათ ივარჯიშოთ სტატიებში შეტანილი პრაქტიკული მაგალითებით. საიტი ხელმისაწვდომია მხოლოდ ქართულ ენაზე.",
      "tags": {
        "1": "Angular",
        "2": "Firebase",
        "3": "SSR",
        "4": "SEO",
        "5": "Express",
        "6": "MongoDB",
        "7": "Full-stack"
      }
    },
    "qr_code": {
      "tag": "გამორჩეული პროექტი",
      "title": "QR Code",
      "description": "მე შევიმუშავე სამეცნიერო პროექტი სახელწოდებით 'ინფორმაციული სისტემების მრავალდონიანი წვდომა QR კოდებით'. იდეა წარმატებით განხორციელდა და იმუშავა უმაღლესი საგანმანათლებლო დაწესებულების, კონკრეტულად კი უნივერსიტეტის მაგალითზე.",
      "tags": {
        "1": "Angular",
        "2": "Express",
        "3": "MongoDB",
        "4": "Full-stack",
        "5": "QR Codes"
      }
    }
  },
  "other_projects": {
    "header": "სხვა საყურადღებო პროექტები",
    "view_archive": "არქივის ხილვა",
    "sliding_game": {
      "name": "Sliding puzzle game",
      "description": "Starting at the top left corner, move the tiles in ascending order in the grid. The tile in the lower right corner should remain 'empty'."
    },
    "memory_card_game": {
      "name": "Memory card game",
      "description": "The objective of the game is to match all pairs of cards as quickly as possible."
    },
    "color_game": {
      "name": "Color game",
      "description": "Guess the color based on the color format RGB or HEX. The colors are randomly generated."
    },
    "qr_project": {
      "name": "QR read & write",
      "description": "Generate QR code with or without an image, or read a QR image."
    },
    "realtime_chat": {
      "name": "Realtime Chat",
      "description": "Join our real-time chat platform to connect instantly with others in general or specialized groups."
    },
    "qa_exercise": {
      "name": "QA Exercise",
      "description": "Discover hidden bugs and vulnerabilities in your Simple Auth/OAuth 2.0 system with our expert testing."
    }
  },
  "contact": {
    "header": "შემეხმიანე",
    "description": "ამჟამად ვეძებ ახალ შესაძლებლობებს, ჩემი ინბოქსი ყოველთვის ღიაა. გაქვთ თუ არა შეკითხვა, ან უბრალოდ გსურთ გამარჯობის თქმა, შემეხმიანეთ!",
    "text": "დამიკავშირდი"
  },
  "archive": {
    "header": "არქივი",
    "subtitle": "საჯარო პროექტების სია, რაზეც ვმუშაობდი, ასევე მაქვს რამდენიმე პროექტი, რომელიც არ არის გამოქვეყნებული ან კერძოა.",
    "year": "წელი",
    "title": "დასახელება",
    "made_at": "გაკეთებულია",
    "built_with": "ხელსაწყო",
    "link": "მისამართი"
  },
  "qr": {
    "title": "Multi-level access to information systems by QR codes for wearable devices",
    "role": {
      "title": "My role in article",
      "text_1": "I was the developer responsible for maintaining all of the code and transforming the entire idea into an app."
    },
    "abstract": {
      "title": "Abstract",
      "text_1": "The scientific project \"Multi-level access of information systems by QR codes for wearable devices\" was carried out within the framework of the scientific grant project of Batumi State University.",
      "text_2": "The idea is practically implemented and discussed in the example of a higher educational institution (university). Various areas of business and state organizations where successful practical implementation of the obtained results is possible are also mentioned.",
      "text_3": "Based on scientific research, an original software product was created, by means of which only one static QR code placed on different objects (in our research mode, BSU auditorium) allows people with different statuses to access different data, in our case, employees and students. At the same time, the QR code assigned to the room remains unchanged even if the processes in the room change, which excludes frequent changes in the graphic image (QR code) placed on the room(object).",
      "text_4": "The mentioned changes will be implemented only in electronic form on the web page where this information is posted and the user will receive only the updated information. For another example, the method can be used to digitize cities, including tourist facilities, restaurants, cafes, banks, etc., to provide different information about users of different access levels (loyalty programs, etc.) through a single QR code.",
      "text_5": " The field of the practical application of the system can be quite wide in terms of its simplicity and technological practicality. Research methodology is based on modern achievements of computer technology, Internet technologies, and programming tools. These technologies are widely used in the research process and in one of the results of the research - the software product."
    }
  }
}
